prst/TM4C1294/blinky.c
//******************************************************************************
t_timer_stat delay_timer_leds5x8 (uint8_t cfg) {
t_timer_stat err_code = _TIMER_NOT_READY;

	if (cfg==0) {
		timer_leds5x8.cur_timer_val=0;
	}

	if (cfg=='?') {
		if ( timer_leds5x8.timer_is_set ) {
			if ( ++timer_leds5x8.cur_timer_val >= timer_leds5x8.set_timer_limit ) {
				err_code = _TIMER_READY;
			} else {
				err_code = _TIMER_NOT_READY;
			}
		} else {
			err_code = _TIMER_NOT_READY;
		}
	}

	return err_code;
}
//******************************************************************************



//******************************************************************************
// Number in to string converter
//******************************************************************************
// itoa
char* IntToStr(int i, char b[]) {
    char const digit[] = "0123456789";
    char* p = b;
    if(i<0){
        *p++ = '-';
        i *= -1;
    }
    int shifter = i;
    do{ //Move to where representation ends
        ++p;
        shifter = shifter/10;
    }while(shifter);
    *p = '\0';
    do{ //Move back, inserting digits as u go
        *--p = digit[i%10];
        i = i/10;
    }while(i);
    return b;
}
//******************************************************************************



//******************************************************************************
// Number in to string converter
//******************************************************************************
// itoa
char* FloatToStr(float ff, char b[]) {
    char const digit[] = "0123456789";
    char *p = b;
    int shifter, i;
    float ostatok;

    ostatok = ff-(int)ff;
    if (ostatok<0) ostatok*=-1;
    if (ostatok<0.0001) ostatok*=10000000;
    if (ostatok<0.001) ostatok*=1000000;
    if (ostatok<0.01) ostatok*=100000;
    if (ostatok<0.1) ostatok*=10000;
    if (ostatok<1) ostatok*=1000;

    i = ff;

    if (i<0) {
        *p++ = '-';
        i *= -1;
    }

    shifter = i;

    do { //Move to where representation ends
        ++p;
        shifter = shifter/10;
        *p = shifter;
    } while (shifter) ;

    //*p = '\0';
    *p = '.';

    do { //Move to where representation ends
        ++p;
        ostatok = ostatok/10;
        *p = ostatok;
    } while ((int)ostatok) ;

    do{ //Move back, inserting digits as u go
        *--p = digit[i%10];
        i = i/10;
    }while(i);

    return b;
}
//******************************************************************************


char data[5]={'1','3','5','7','9'};

//******************************************************************************
// Blinks on the leds and indicator.
//******************************************************************************
int main (void) {
    volatile uint32_t nn;
    volatile uint32_t cnt=0;
    char *tmp;
    float in=-47.531;

    //SysCtlClockSet(SYSCTL_SYSDIV_1|SYSCTL_USE_OSC|SYSCTL_OSC_MAIN|SYSCTL_XTAL_16MHZ);
    //SysCtlPWMClockSet(SYSCTL_PWMDIV_1); //Set the PWM clock to the system clock.

    drv_sys_init_gpio ();
    drv_usr_init_led_7segments ();
    drv_usr_init_timer_and_scheduler ();

	double num=34267;
	char   output[10];
	//snprintf(output,10,"%f",num);

	while(1) {  // Loop forever.
		if (  _TIMER_READY == delay_timer_leds5x8('?') ) {
			if ( nn < 5 ) {
				//tmp = ltoa(in, (char *)data); // ltoa - max string 34 bytes.
				//tmp = FloatToStr(in, data); // ltoa - max string 34 bytes.
				drv_led_7segments_position ( nn ); // dinamic switching
				drv_led_7segments_symbol   ( data/*output*/[nn]/*&0x0F*/ ); // display info
				nn++;
				cnt++;
    		} else {
				nn = 0;
    		}
			delay_timer_leds5x8(0);
    	}

    	drv_led_blink ();
    }
}
//******************************************************************************
